# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint
a = [randint(3, 9) for i in range(10)]
print(a)
maximum = 0
ryad = 1
for i in range(1, len(a)-1):
    if a[i]+a[i-1]+a[i+1] > maximum:
        maximum = a[i]+a[i-1]+a[i+1]
        ryad = i+1
print(f'максимальное количество ягод равно {maximum} на ряде {ryad} ')
